; domain
(define (domain photography_learning)
  (:requirements :strips :typing)
  (:types
    entity
  )
  
  (:predicates
    (studio_setup ?s - entity)
    (reflector_appropriate ?r - entity)
    (lens_closeup ?l - entity)
    (light_diffused ?li - entity)
    (experiment_started ?e - entity)
  )

  (:action create_small_studio
    :parameters (?s - entity)
    :precondition (and)
    :effect (and (studio_setup ?s))
  )

  (:action have_appropriate_reflectors
    :parameters (?r - entity)
    :precondition (and)
    :effect (and (reflector_appropriate ?r))
  )

  (:action have_closeup_lens
    :parameters (?l - entity)
    :precondition (and)
    :effect (and (lens_closeup ?l))
  )

  (:action diffuse_light
    :parameters (?li - entity)
    :precondition (and)
    :effect (and (light_diffused ?li))
  )

  (:action start_experimenting
    :parameters (?e - entity)
    :precondition (and)
    :effect (and (experiment_started ?e))
  )
)

; problem
(define (problem photography_learning_problem)
  (:domain photography_learning)
  
  (:objects
    studio - entity
    reflector - entity
    lens - entity
    light - entity
    experiment - entity
  )
  
  (:init
    ; Initial states corresponding to first step or uninitialized states
  )
  
  (:goal
    (and
      (studio_setup studio)
      (reflector_appropriate reflector)
      (lens_closeup lens)
      (light_diffused light)
      (experiment_started experiment)
    )
  )
)

; plan
1. (create_small_studio studio)
   added: (studio_setup studio)
   goals met: 1 of 5
2. (diffuse_light light)
   added: (light_diffused light)
   goals met: 2 of 5
3. (have_appropriate_reflectors reflector)
   added: (reflector_appropriate reflector)
   goals met: 3 of 5
4. (have_closeup_lens lens)
   added: (lens_closeup lens)
   goals met: 4 of 5
5. (start_experimenting experiment)
   added: (experiment_started experiment)
   goals met: 5 of 5
